app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name") VALUES (?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"]]
---
  def create
    @student = Student.create(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(student_params)